base/DataProcessors/бит_СозданиеФормВводаБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_СозданиеФормВводаБюджета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗависимыхОборотов</Name>
					<Comment>Режим формирования зависимых оборотов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыЗависимыхОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимФормированияДвижений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыФормированияДвиженийФормыВвода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияСумм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ЕдиницыИзмеренияСумм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКПапке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФормыВводаБюджета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НастройкаФормы</Name>
							<Comment>Настройка формы ввода бюджета</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_НастройкиФормВводаБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсДокумента</Name>
							<Comment>Курс документа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьДокумента</Name>
							<Comment>Кратность документа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Comment>Сценарий</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимЗависимыхОборотов</Name>
							<Comment>Режим формирования зависимых оборотов</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_РежимыЗависимыхОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимФормированияДвижений</Name>
							<Comment>Режим формирования движений</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_РежимыФормированияДвиженийФормыВвода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияСумм</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ЕдиницыИзмеренияСумм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Comment>ЦФО</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Comment>Статья оборотов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>Договор контрагента</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Comment>Проект</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Comment>Номенклатурная группа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Comment>Банковский счет</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_1</Name>
							<Comment>Дополнительная аналитика № 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2</Name>
							<Comment>Дополнительная аналитика № 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3</Name>
							<Comment>Дополнительная аналитика № 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4</Name>
							<Comment>Дополнительная аналитика № 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_5</Name>
							<Comment>Дополнительная аналитика № 5</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_6</Name>
							<Comment>Дополнительная аналитика № 6</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_7</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_8</Name>
							<Comment>Дополнительная аналитика № 8</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_9</Name>
							<Comment>Дополнительная аналитика № 9</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_10</Name>
							<Comment>Дополнительная аналитика № 10</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_11</Name>
							<Comment>Дополнительная аналитика № 11</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_12</Name>
							<Comment>Дополнительная аналитика № 12</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Comment>Ответственный</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Comment>Комментарий</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док_ФормаВводаБюджета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ФормаВводаБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док_ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>215</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док_КоличествоРазворачивать</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док_ИдКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док_ВыгруженШаблонВExcel</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗагруженныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Док_ФормаВводаБюджета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ФормаВводаБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док_ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>259</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док_ИдКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док_ЗагруженыДанныеИзExcel</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/DataProcessors/бит_СозданиеФормВводаБюджета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция РезультаСформированияДокументов(ДанныеОбработки) Экспорт
    
    РеквизитыДокумента  = Метаданные.Документы.бит_ФормаВводаБюджета.Реквизиты;
    
    ТекущийПользователь 		  = Пользователи.ТекущийПользователь();	
	ДанныеДляЗаполненияДокументов = ДанныеОбработки.ДанныеДляЗаполненияДокументов;
	НастройкаИмениФайла 		  = ДанныеОбработки.НастройкаИмениФайла;
	
	ИменаКолонок = Новый Массив;
	Для каждого Колонка Из ДанныеДляЗаполненияДокументов.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		Если Лев(ИмяКолонки, 4) = "Док_" ИЛИ РеквизитыДокумента.Найти(ИмяКолонки) = Неопределено Тогда
			Продолжить;            
		КонецЕсли;	
		ИменаКолонок.Добавить(ИмяКолонки);
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из ДанныеДляЗаполненияДокументов Цикл
        
        Если НЕ СтрокаТаблицы.Выбрать ИЛИ ЗначениеЗаполнено(СтрокаТаблицы.Док_ФормаВводаБюджета) Тогда
            Продолжить;       
        КонецЕсли;
        
        // Создание документа.
        ДокументОбъект = Документы.бит_ФормаВводаБюджета.СоздатьДокумент();
        
        ДанныеЗаполнения = Новый Структура;
		
		ДанныеЗаполнения.Вставить("ДатаНачалаПланирования",    ДанныеОбработки.ПериодПланирования.ДатаНачала);
        ДанныеЗаполнения.Вставить("ДатаОкончанияПланирования", ДанныеОбработки.ПериодПланирования.ДатаОкончания);
        
        Для каждого ИмяКолонки Из ИменаКолонок Цикл            
			Значение = Неопределено;
			ДанныеОбработки.Свойство(ИмяКолонки, Значение);
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[ИмяКолонки]) И ЗначениеЗаполнено(Значение) Тогда
                 // Если в тч реквизит не заполнен, то берем из шапки.
            	 ДанныеЗаполнения.Вставить(ИмяКолонки, ДанныеОбработки[ИмяКолонки]);           
            Иначе
                 ДанныеЗаполнения.Вставить(ИмяКолонки, СтрокаТаблицы[ИмяКолонки]);
            КонецЕсли;         	
        КонецЦикла;
        
        Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Ответственный) Тогда
            ДанныеЗаполнения.Вставить("Ответственный", ТекущийПользователь);
        КонецЕсли;
        
        // Заполнение документа через экспортную процедуру модуля документа.
        ДокументОбъект.ЗаполнитьДокумент(ДанныеЗаполнения);
        ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);

		СтрокаТаблицы.Док_ФормаВводаБюджета = ДокументОбъект.Ссылка;
		НастройкиФормы = Справочники.бит_НастройкиФормВводаБюджета.ПодготовитьНастройки(СтрокаТаблицы.НастройкаФормы);// ++ NB посмотреть 
		СтрокаТаблицы.Док_КоличествоРазворачивать = НастройкиФормы.КоличествоРазворачивать; 
		СтрокаТаблицы.Док_ИдКартинки              = 0;
		СтрокаТаблицы.Док_ИмяФайла                = ИмяФайлаПоНастройкам(ДокументОбъект, НастройкаИмениФайла);			 
    КонецЦикла;
	
	Возврат ДанныеДляЗаполненияДокументов;

КонецФункции

Функция ИмяФайлаПоНастройкам(ТекДокумент, НастройкаИмениФайла) Экспорт

    ИмяФайла = "";
    
    МассивСтрок = Новый Массив;
    Для каждого ЭлСп Из НастройкаИмениФайла Цикл
        Если ЭлСп.Значение = "ПроизвольныйТекст" Тогда
            МассивСтрок.Добавить(ЭлСп.Представление);
        ИначеЕсли ЭлСп.Значение = "НомерДокумента" Тогда
            МассивСтрок.Добавить(СокрЛП(ТекДокумент.Номер));       
        Иначе 
            МетаРек = Метаданные.Документы.бит_ФормаВводаБюджета.Реквизиты.Найти(ЭлСп.Значение);
            Если МетаРек <> Неопределено Тогда
                ЗначениеРеквизита = ТекДокумент[ЭлСп.Значение];
                Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
                    МассивСтрок.Добавить(ЗначениеРеквизита.Наименование);       
                КонецЕсли;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла; 
    ИмяФайла = СтрСоединить(МассивСтрок, " - ");
                
    // Удаление недопустимых символов.
    ИмяФайла = СтрЗаменить(ИмяФайла, "\" , "");
    ИмяФайла = СтрЗаменить(ИмяФайла, "/" , "");
    ИмяФайла = СтрЗаменить(ИмяФайла, ":" , "");
    ИмяФайла = СтрЗаменить(ИмяФайла, "*" , "");
    ИмяФайла = СтрЗаменить(ИмяФайла, "?" , "");
    ИмяФайла = СтрЗаменить(ИмяФайла, """", "");
    ИмяФайла = СтрЗаменить(ИмяФайла, "<" , "");
    ИмяФайла = СтрЗаменить(ИмяФайла, ">" , "");
    ИмяФайла = СтрЗаменить(ИмяФайла, "|" , "");
       
    Возврат ИмяФайла;
	
КонецФункции

Функция НовыеДанныеОбработки() Экспорт

	ДанныеОбработки = Новый Структура;
	ДанныеОбработки.Вставить("Сценарий");
	ДанныеОбработки.Вставить("ВалютаДокумента");
	ДанныеОбработки.Вставить("КурсДокумента",	   1);
	ДанныеОбработки.Вставить("КратностьДокумента", 1);
	ДанныеОбработки.Вставить("РежимЗависимыхОборотов");
	ДанныеОбработки.Вставить("РежимФормированияДвижений");
	ДанныеОбработки.Вставить("ЕдиницаИзмеренияСумм");
	
	ДанныеОбработки.Вставить("ПериодПланирования", 			  Новый СтандартныйПериод);
	ДанныеОбработки.Вставить("ДанныеДляЗаполненияДокументов", Новый ТаблицаЗначений);
	ДанныеОбработки.Вставить("НастройкаИмениФайла", 		  Новый СписокЗначений);
	
	Возврат ДанныеОбработки; 
	
КонецФункции

#КонецОбласти

#КонецЕсли
